tests/fvConstraints/case/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

UCast    (0 0 -0.001);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $UCast;

boundaryField
{
    "(hot-top|ceramic|graphite|mould|air-gap|water-film|free-surface|ram)"
    {
        type            zeroGradient;
    }

    symmetry_planes
    {
        type            symmetry;
    }
}

// ************************************************************************* //
